{
  "backend/main.mo": "Motoko actor storing contact form submissions, exposing queries for business info and placeholder traps for frontend-only actions.",
  "feature_evidence.json": "JSON report mapping implemented features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing pre-written summaries of frontend source files for reference.",
  "frontend/index.css": "Tailwind base configuration with OKLCH color variables, dark mode overrides, and global styling rules.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with main routes and wraps all pages in SiteLayout.",
  "frontend/src/components/BusinessInfo.tsx": "Component fetching and displaying address, phone, and opening hours using backend queries.",
  "frontend/src/components/ContactForm.tsx": "Contact form handling validation, submission to backend, and displaying a success state.",
  "frontend/src/components/CtaButton.tsx": "Wrapper around the UI Button component applying consistent CTA styling.",
  "frontend/src/components/DesignSystem.ts": "Central config exporting site name, navigation items, social links, CTA labels, and business info.",
  "frontend/src/components/FeatureIconCard.tsx": "Card component showing an icon, title, and description for feature highlights.",
  "frontend/src/components/GalleryGrid.tsx": "Components for gallery sections and images with responsive grid layout and hover effects.",
  "frontend/src/components/PricingCard.tsx": "A pricing card component displaying a title, optional price, feature list, and a button linking to the contact page.",
  "frontend/src/components/ProgramCard.tsx": "Shows a program with an image, title, and description inside a styled card.",
  "frontend/src/components/Section.tsx": "A layout wrapper that renders a section with padding and a container.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, quick links, social icons, and copyright text.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive navigation header with desktop and mobile menus and a join button.",
  "frontend/src/components/SiteLayout.tsx": "Wraps the page with a header, footer, and main content area.",
  "frontend/src/components/TestimonialCard.tsx": "Displays a testimonial with rating stars, quote text, and author details.",
  "frontend/src/components/TrainerCard.tsx": "Shows trainer info including image, name, specialty, and qualification highlights.",
  "frontend/src/hooks/useActor.ts": "Creates and provides a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and stored identities through a React context.",
  "frontend/src/hooks/usePageTitle.ts": "Sets the document title based on the provided page title and restores it on cleanup.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for submitting contact forms and fetching business info via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, dark theme variables, global typography, scrollbars, and utility classes.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Initializes React, sets up QueryClient and InternetIdentityProvider, and renders the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero, mission, values, and story sections using images and styled content.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form, business info, and quick-action buttons for WhatsApp, calling, and maps.",
  "frontend/src/pages/GalleryPage.tsx": "Shows categorized image galleries of the gym interior, workouts, equipment, and clients.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero banner, feature highlights, and sections for workouts and testimonials.",
  "frontend/src/pages/PlansPage.tsx": "Presents membership plans with pricing cards and a benefits section.",
  "frontend/src/pages/ProgramsPage.tsx": "Lists all training programs using ProgramCard components in a responsive grid.",
  "frontend/src/pages/TrainersPage.tsx": "Displays trainer profiles and an info section about their expertise and guidance.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, typography, container queries, and extended theme settings.",
  "project_state.json": "Defines the project’s current state and requirements for a gym marketing website, including images, features, and architectural notes."
}